INSERT INTO Users VALUES 
(1, '1234567890', '09120000001', N'اشکان فدایی', 3, '2023-01-01', '2025-05-01 10:00:00' , 1),
(2, '2345678901', '09120000002', N'حسین رحمتی', 1, '2023-03-15', '2025-04-29 14:30:00' , 2),
(3, '3456789012', '09120000003', N'بهرام نورایی',  0, '2024-06-10', '2025-01-10 09:20:00' , 3),
(4, '4567890123', '09120000004', N'مهدیار آقاجانی', 5, '2023-11-05', '2025-05-03 18:00:00' , 4),
(5, '5678901234', '09120000005', N'سروش لشکری',  2, '2024-01-22', '2025-02-25 16:45:00' , 5);

INSERT INTO Addresses VALUES
(1, 1, N'تهران، خیابان آزادی، پلاک 12' , 'تهران' ,'تهران' , 2 , 3 , 1663555 ),
(2, 2, N'مشهد، بلوار سجاد، کوچه 5'    , 'مشهد'  , 'مشهد' , 3,6,1745673),
(3, 3, N'اصفهان، میدان نقش جهان' , 'اصفهان' , 'اصفهان' , 4,7 , 184647435),
(4, 4, N'شیراز، خیابان زند' , 'شیراز' ,  'شیراز' , 4 , 1 , 19984924),
(5, 5, N'تبریز، خیابان ولیعصر' , 'تبریز' , 'تبریز' , 3 , 2 , 14764356);

INSERT INTO Admins VALUES
(1, N'حسین قاسمی', N'h.ghasemi@example.com', '2025-05-01 08:00:00'),
(2, N'نرگس سلطانی', N'n.soltani@example.com', '2025-04-30 09:45:00'),
(3, N'مجید امینی', N'm.amini@example.com', '2025-03-15 11:30:00'),
(4, N'الهام رجبی', N'e.rajabi@example.com', '2025-02-20 10:10:00'),
(5, N'کامران رضوی', N'k.razavi@example.com', '2025-01-05 12:00:00');

INSERT INTO Stores VALUES
(1, 'دیجی‌موبایل', 'آنلاین', '0210000001', 1),
(2, 'موبایل‌کالا', 'حضوری', '0210000002', 2),
(3, 'بازار موبایل', 'حضوری', '0210000003', 3),
(4, 'همراه اول', 'آنلاین', '0210000004', 4),
(5, 'گوشی‌فروش', 'آنلاین', '0210000005', 5);

INSERT INTO Products VALUES
(1, N'گوشی A14', N'Samsung', 7000000, 15, 1),
(2, N'گوشی Note 12', N'Xiaomi', 8500000, 10, 2),
(3, N'iPhone 13', N'Apple', 30000000, 5, 3),
(4, N'گوشی Y9a', N'Huawei', 9500000, 8, 4),
(5, N'گوشی Nord CE2', N'OnePlus', 11000000, 7, 5);

INSERT INTO StoreProducts VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5);

INSERT INTO Ratings VALUES
(1, 1, 1, 1, 5, '2025-05-01'),
(2, 2, 2, 2, 4, '2025-04-30'),
(3, 3, 3, 3, 3, '2025-04-29'),
(4, 4, 4, 4, 5, '2025-04-28'),
(5, 5, 5, 5, 4, '2025-04-27');

INSERT INTO Orders VALUES
(1, 1, 1, 'TRK001', '2025-04-20', 7000000, N'پست', 1),
(2, 2, 2, 'TRK002', '2025-04-21', 8500000, N'پیک', 2),
(3, 3, 3, 'TRK003', '2025-04-22', 30000000, N'پست', 3),
(4, 4, 4, 'TRK004', '2025-04-23', 9500000, N'پیک', 4),
(5, 5, 5, 'TRK005', '2025-04-24', 11000000, N'پست', 5);

INSERT INTO OrderProducts VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5);

INSERT INTO Shipping VALUES
('TRK001', 1, N'پست', '2025-04-21', N'تحویل‌شده', 1),
('TRK002', 2, N'پیک', '2025-04-22', N'در حال ارسال', 2),
('TRK003', 3, N'پست', '2025-04-23', N'تحویل‌شده', 3),
('TRK004', 4, N'پیک', '2025-04-24', N'در حال ارسال', 4),
('TRK005', 5, N'پست', '2025-04-25', N'تحویل‌شده', 5);
